In [1]:
%load_ext sql

In [3]:
%sql sqlite:///myfile.db

In [4]:
%%sql
SELECT 
	country, 
    MIN(date_account_start) AS first_account
FROM customers
GROUP BY country
ORDER BY first_account ASC;

 * sqlite:///myfile.db
Done.

[('France', '2017-01-13'),
 ('Hungary', '2017-01-18'),
 ('Belgium', '2017-01-28'),
 ('Slovenia', '2017-01-31'),
 ('Spain', '2017-02-14'),
 ('Italy', '2017-02-28'),
 ('Poland', '2017-03-03'),
 ('Great Britan', '2017-03-31'),
 ('Denmark', '2017-04-30'),
 ('USA', '2017-09-13'),
 ('Austria', '2017-11-22')]

In [7]:
%%sql
SELECT movie_id, 
       AVG(rating) AS avg_rating,
       COUNT(rating) AS num_ratings,
       COUNT(DISTINCT renting_id) AS num_views
FROM renting
GROUP BY movie_id limit 5;

 * sqlite:///myfile.db
Done.

[(1, 7.25, 4, 8),
 (2, 7.25, 4, 6),
 (3, 9.0, 2, 11),
 (4, 7.888888888888889, 9, 14),
 (5, 9.75, 4, 8)]

In [9]:
%%sql
SELECT movie_id, 
       AVG(rating) -- Calculate average rating per movie
FROM renting
GROUP BY movie_id limit 5;

 * sqlite:///myfile.db
Done.

[(1, 7.25), (2, 7.25), (3, 9.0), (4, 7.888888888888889), (5, 9.75)]

In [11]:
%%sql
SELECT 
  movie_id, 
  AVG(rating) AS avg_rating, 
  COUNT(rating) AS number_rating, 
  COUNT(*) AS number_renting  
FROM 
  renting 
GROUP BY 
  movie_id limit 5;

 * sqlite:///myfile.db
Done.

[(1, 7.25, 4, 8),
 (2, 7.25, 4, 6),
 (3, 9.0, 2, 11),
 (4, 7.888888888888889, 9, 14),
 (5, 9.75, 4, 8)]

In [15]:
%%sql
SELECT movie_id, 
       AVG(rating) AS avg_rating,
       COUNT(rating) AS number_ratings,
       COUNT(*) AS number_renting
FROM renting
GROUP BY movie_id
ORDER BY avg_rating DESC limit 5; -- Order by average rating in decreasing order

 * sqlite:///myfile.db
Done.

[(48, 10.0, 2, 5),
 (5, 9.75, 4, 8),
 (42, 9.6, 5, 10),
 (63, 9.333333333333334, 6, 11),
 (65, 9.0, 5, 5)]

In [19]:
%%sql
SELECT customer_id,  -- Report the customer_id
       AVG(rating), -- Report the average rating per customer
       COUNT(rating), -- Report the number of ratings per customer
       COUNT(*) as count   -- Report the number of movie rentals per customer
FROM renting
GROUP BY customer_id
HAVING COUNT(*) > 7 -- Select only customers with more than 7 movie rentals
ORDER BY AVG(rating) limit 3; -- Order by the average rating in ascending order

 * sqlite:///myfile.db
Done.

[(104, 6.25, 4, 8), (28, 6.714285714285714, 7, 11), (111, 7.0, 3, 10)]

In [21]:
%%sql
SELECT avg(rating) as rating
-- Average ratings of customers from Belgium
FROM renting AS r
LEFT JOIN customers AS c
ON r.customer_id = c.customer_id
WHERE c.country='Belgium';

 * sqlite:///myfile.db
Done.

[(8.9,)]

In [22]:
%%sql
SELECT 
	SUM(m.renting_price), 
	COUNT(*), 
	COUNT(DISTINCT r.customer_id)
FROM renting AS r
LEFT JOIN movies AS m
ON r.movie_id = m.movie_id
-- Only look at movie rentals in 2018
WHERE date_renting BETWEEN '2018-01-01' AND '2018-12-31' ;

 * sqlite:///myfile.db
Done.

[(658.0200000000004, 298, 93)]

In [24]:
%%sql
SELECT  -- Create a list of movie titles and actor names
       title,name
FROM actsin ai
LEFT JOIN movies AS m
ON m.movie_id = ai.movie_id
LEFT JOIN actors AS a
ON a.actor_id = ai.actor_id limit 4;

 * sqlite:///myfile.db
Done.

[('Candy', 'Abbie Cornish'),
 ('Jack and Jill', 'Adam Sandler'),
 ('Simone', 'Al Pacino'),
 ('The Recruit', 'Al Pacino')]

In [25]:
%%sql
SELECT m.title,  -- Use a join to get the movie title and price for each movie rental
       m.renting_price
FROM renting AS r
LEFT JOIN movies AS m
ON r.movie_id=m.movie_id limit 3;

 * sqlite:///myfile.db
Done.

[('Waking Up in Reno', 2.59),
 ('Two for the Money', 2.79),
 ('Burn After Reading', 2.39)]

In [26]:
%%sql
SELECT rm.title, -- Report the income from movie rentals for each movie 
       SUM(rm.renting_price) AS income_movie
FROM
       (SELECT m.title, 
               m.renting_price
       FROM renting AS r
       LEFT JOIN movies AS m
       ON r.movie_id=m.movie_id) AS rm
GROUP BY rm.title
ORDER BY income_movie DESC limit 5; -- Order the result by decreasing income

 * sqlite:///myfile.db
Done.

[('Bridget Jones - The Edge of Reason', 37.57),
 ('Fair Game', 34.68),
 ('The Kingdom', 31.349999999999998),
 ('Two for the Money', 30.689999999999994),
 ('Simone', 29.590000000000007)]

In [28]:
%%sql
SELECT rm.title, -- Report the income from movie rentals for each movie 
       SUM(rm.renting_price) AS income_movie
FROM
       (SELECT m.title, 
               m.renting_price
       FROM renting AS r
       LEFT JOIN movies AS m
       ON r.movie_id=m.movie_id) AS rm
GROUP BY rm.title
ORDER BY income_movie DESC limit 4; -- Order the result by decreasing income

 * sqlite:///myfile.db
Done.

[('Bridget Jones - The Edge of Reason', 37.57),
 ('Fair Game', 34.68),
 ('The Kingdom', 31.349999999999998),
 ('Two for the Money', 30.689999999999994)]

In [29]:
%%sql
SELECT a.gender, -- Report for male and female actors from the USA 
       MIN(a.year_of_birth), -- The year of birth of the oldest actor
       MAX(a.year_of_birth) -- The year of birth of the youngest actor
FROM
    (SELECT * -- Use a subsequent SELECT to get all information about actors from the USA
    FROM actors
    WHERE nationality = 'USA') AS a -- Give the table the name a
GROUP BY a.gender;

 * sqlite:///myfile.db
Done.

[('female', 1945.0, 1993.0), ('male', 1930.0, 1992.0)]

In [32]:
%%sql
SELECT *
FROM renting as r
LEFT JOIN customers AS c         -- Augment table renting with information about customers
ON r.customer_id = c.customer_id 
LEFT JOIN actsin as ai           -- Join the table renting with the table actsin
ON r.movie_id = ai.movie_id
LEFT JOIN actors as a            -- Augment table renting with information about actors
ON ai.actor_id = a.actor_id limit 4;

 * sqlite:///myfile.db
Done.

[(1, 41, 8, None, '2018-10-09', 41, 'Zara Mitchell', 'Great Britan', 'female', '1994-07-08', '2017-06-12', 28, 8, 23, 23, 'Charlize Theron', 1975.0, 'South Africa', 'female'),
 (1, 41, 8, None, '2018-10-09', 41, 'Zara Mitchell', 'Great Britan', 'female', '1994-07-08', '2017-06-12', 152, 8, 103, 103, 'Natasha Richardson', 1963.0, 'British', 'female'),
 (1, 41, 8, None, '2018-10-09', 41, 'Zara Mitchell', 'Great Britan', 'female', '1994-07-08', '2017-06-12', 160, 8, 107, 107, 'Patrick Swayze', 1952.0, 'USA', 'male'),
 (2, 10, 29, 10.0, '2017-03-01', 10, 'Arnout Veenhuis', 'Belgium', 'male', '1984-07-26', '2017-01-28', 5, 29, 3, 3, 'Al Pacino', 1940.0, 'USA', 'male')]

In [34]:
%%sql
SELECT a.name,  c.gender,
       COUNT(*) AS number_views, 
       AVG(r.rating) AS avg_rating
FROM renting as r
LEFT JOIN customers AS c
ON r.customer_id = c.customer_id
LEFT JOIN actsin as ai
ON r.movie_id = ai.movie_id
LEFT JOIN actors as a
ON ai.actor_id = a.actor_id

GROUP BY a.name, c.gender -- For each actor, separately for male and female customers
HAVING AVG(r.rating) IS NOT NULL 
  AND COUNT(*) > 5 -- Report only actors with more than 5 movie rentals
ORDER BY avg_rating DESC, number_views DESC limit 5; -- Order by average rating in descending order

 * sqlite:///myfile.db
Done.

[('Tommy Lee Jones', 'female', 6, 10.0),
 ('Josh Brolin', 'female', 6, 10.0),
 ('Javier Bardem', 'female', 6, 10.0),
 ('Leonardo DiCaprio', 'female', 8, 9.333333333333334),
 ('Christoph Waltz', 'female', 8, 9.333333333333334)]

In [35]:
%%sql
SELECT a.name,  c.gender,
       COUNT(*) AS number_views, 
       AVG(r.rating) AS avg_rating
FROM renting as r
LEFT JOIN customers AS c
ON r.customer_id = c.customer_id
LEFT JOIN actsin as ai
ON r.movie_id = ai.movie_id
LEFT JOIN actors as a
ON ai.actor_id = a.actor_id
where c.country = 'Spain'  -- Select only customers from Spain
GROUP BY a.name, c.gender
HAVING AVG(r.rating) IS NOT NULL 
  AND COUNT(*) > 5 
ORDER BY avg_rating DESC, number_views DESC;

 * sqlite:///myfile.db
Done.

[('Catherine Keener', 'female', 6, 8.0),
 ('Rupert Grint', 'male', 7, 7.6),
 ('Emma Watson', 'male', 7, 7.6),
 ('Daniel Radcliffe', 'male', 7, 7.6)]

In [39]:
%%sql
SELECT *
FROM renting AS r -- Augment the table renting with information about customers
LEFT JOIN customers AS c
ON c.customer_id = r.customer_id
LEFT JOIN movies AS m -- Augment the table renting with information about movies
ON r.movie_id = m.movie_id
WHERE date_renting >= '2019-01-01' limit 4; --Select only records about rentals since beginning of 2019

 * sqlite:///myfile.db
Done.

[(5, 104, 15, 7.0, '2019-03-18', 104, 'Dimitri Zambrano Morales', 'Spain', 'male', '1992-06-21', '2017-04-12', 15, "Something's Gotta Give", 'Comedy', 128, 2003, 1.69),
 (17, 22, 46, 10.0, '2019-02-16', 22, 'Delit Perillard', 'France', 'female', '1970-01-10', '2018-11-18', 46, 'Sleepwalking', 'Drama', 101, 2008, 1.79),
 (18, 36, 39, 10.0, '2019-03-20', 36, 'Jacob Hope', 'Great Britan', 'male', '1979-08-27', '2018-06-24', 39, "I'm Not There", 'Drama', 135, 2007, 1.79),
 (27, 7, 36, None, '2019-03-14', 7, 'Annelous Sneep', 'Belgium', 'female', '1993-11-14', '2018-05-12', 36, 'World Trade Center', 'Drama', 129, 2006, 1.59)]

In [40]:
%%sql
SELECT 
	c.country,                      -- For each country report
	COUNT(*) AS number_renting,   -- The number of movie rentals
	AVG(r.rating) AS average_rating,  -- The average rating
	SUM(m.renting_price) AS revenue  -- The revenue from movie rentals
FROM renting AS r
LEFT JOIN customers AS c
ON c.customer_id = r.customer_id
LEFT JOIN movies AS m
ON m.movie_id = r.movie_id
WHERE date_renting >= '2019-01-01'
GROUP BY c.country;

 * sqlite:///myfile.db
Done.

[(None, 1, 10.0, 1.79),
 ('Austria', 4, 6.0, 8.16),
 ('Belgium', 7, 9.0, 13.129999999999999),
 ('Denmark', 7, 7.714285714285714, 14.630000000000003),
 ('France', 23, 7.533333333333333, 51.07000000000001),
 ('Great Britan', 9, 7.2, 17.91),
 ('Hungary', 11, 7.166666666666667, 25.89),
 ('Italy', 30, 8.235294117647058, 69.9),
 ('Poland', 21, 8.125, 49.29),
 ('Slovenia', 14, 8.0, 30.259999999999998),
 ('Spain', 26, 8.076923076923077, 57.94000000000001),
 ('USA', 6, 9.0, 14.540000000000001)]